blog/2022/dom-scripting.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-07 Mon 13:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>DOM Scripting</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">DOM Scripting</h1>
</header><p>
这本书讲了哪些内容：
</p>

<p>
JS 的历史：JS 的起源，浏览器（Netscape Navigator &amp; Internet Explorer）之间的竞争，网景（Netscape）公司为了对抗微软，联合 Sun 公司和 ECMA 对 JS 进行标准化——ECMAScript，JS 作为解释型脚本语言存在（与 Java 这种编译型语言不同），JS 能够使开发者操作浏览器，DOM（一种概念化文档的方式），世界对象模型（生活中的事物、抽象概念），DOM Level 0，W3C 推出标准化 DOM（这使得任何程序设计语言都能对标记语言写出来的文档进行操控），DOM Level 1（1998.10），DOM 是一种 API（API 是一组已经得到有关各方共同认可的基本约定）。
</p>

<p>
JS 的语法：语句，注释，变量（variable），赋值（将值存入变量），字面量（literal），数组，操作符，条件语句，循环语句，函数，对象。
</p>

<p>
DOM：节点，getElementById,getElementsByTagName,getElementsByClassName,getAttribute,setAttribute
</p>

<p>
编译型语言与解释型语言的区别？
</p>

<ol class="org-ol">
<li>在错误提示方面，前者先编译后运行，在编译时即可提示代码 bug；而后者只有在执行到错误代码位置时，才会提示错误</li>
<li>与解释型语言相比，编译型语言速度更快，可移植性更好</li>
</ol>

<p>
通过理解英语，来理解什么是解释型语言。
</p>

<p>
驼峰格式是函数名、方法名和对象属性名命名的首选格式。
</p>

<p>
变量命名时，首字母为什么不能是数字？
</p>

<p>
通过反引号引入变量： <code>`${myVar}`</code>
</p>

<p>
变量名的命名规则？
</p>

<ol class="org-ol">
<li>不包含空格、标点符号（$ 除外）</li>
<li>允许包含字母、数字、美元符号和下划线（但首字母必须为非数字）</li>
</ol>

<p>
JS 最重要的三种数据类型：字符串，数值，布尔值。
</p>

<p>
转义字符
</p>

<p>
一个数组作为另一个数组的元素
</p>

<div id="outline-container-org80e5c9b" class="outline-2">
<h2 id="org80e5c9b">对象</h2>
<div class="outline-text-2" id="text-org80e5c9b">
<p>
用点号获取属性和花括号语法创建对象。
</p>
</div>
</div>

<div id="outline-container-org94b0fd5" class="outline-2">
<h2 id="org94b0fd5">操作</h2>
<div class="outline-text-2" id="text-org94b0fd5">
<p>
自增、自减
</p>

<p>
字符串与数值之间的类型转换：
</p>

<ol class="org-ol">
<li>字符串拼接数字，成为字符串</li>
<li>两个数字拼接，成为数值</li>
</ol>

<p>
+= 加法和赋值
</p>
</div>
</div>

<div id="outline-container-org4c363ba" class="outline-2">
<h2 id="org4c363ba">条件语句</h2>
<div class="outline-text-2" id="text-org4c363ba">
<p>
if&#x2026;else&#x2026;
</p>

<p>
为什么赋值运算并非总是返回真值？
</p>
</div>
</div>

<div id="outline-container-org7b5b068" class="outline-2">
<h2 id="org7b5b068">循环语句</h2>
<div class="outline-text-2" id="text-org7b5b068">
<p>
do&#x2026;while 循环内部的代码至少执行一次
</p>
</div>
</div>

<div id="outline-container-org1a3ee6e" class="outline-2">
<h2 id="org1a3ee6e">函数</h2>
<div class="outline-text-2" id="text-org1a3ee6e">
<p>
传参
</p>
</div>
</div>

<div id="outline-container-org0c9427b" class="outline-2">
<h2 id="org0c9427b">变量的作用域</h2>
<div class="outline-text-2" id="text-org0c9427b">
<p>
全局变量：可在任何位置被引用，它的作用域是整个脚本；
</p>

<p>
局部变量：只存在于声明它的函数内部，作用域仅限于当前函数
</p>

<p>
仅在函数内部使用的变量一定为局部变量
</p>
</div>
</div>

<div id="outline-container-orgfbb4367" class="outline-2">
<h2 id="orgfbb4367">对象</h2>
<div class="outline-text-2" id="text-orgfbb4367">
<p>
对象是自包含的数据集合，包含在对象里的数据可以通过两种形式访问——属性和方法：
</p>

<ul class="org-ul">
<li>属性是隶属于某个特定对象的变量</li>
<li>方法是只有某个特定对象才能调用的函数</li>
</ul>

<p>
为了用对象描述目标事物，需要创建对象实例
</p>

<p>
创建自己的对象——用户定义对象，与之对应的是内建对象：Array，Math，Date
</p>

<p>
宿主对象：由运行环境提供，如 document
</p>
</div>
</div>
</div>
</body>
</html>